<template>
  <div id="app">
    <!--
      进入新页面的时候：
        在进入新页面的时候，原页面（首页）执行一个从屏幕中展示的位置
        从右到左移动出屏幕的动画。同时新页面（商品列表）执行一个从屏幕
        右侧，从右到左移动到屏幕中
      在后退页面的时候：
        原页面（商品列表）执行一个从屏幕中展示的位置，从左到右移动出屏幕
        的滑动。新页面（首页）执行一个从屏幕左侧，从左到右移动到屏幕中的动画
     -->

    <!--
      页面过渡效果实现逻辑：
        1、创建动画的CSS
        2、判断当前是需要执行跳转动画（进入新页面）还是后退动画（在后退页面）
          1、监听路由对象 $route
          2、让页面在跳转的时候，携带包含跳转标记的 params，通过对params标记
             的判断，来判断当前是否为跳转标记的动画
          3、如果说 params 包含跳转标记，那么表示当前为跳转动画，否则当前为后退动画
        3、通过 transition 的方式来为 router-view 指定对应的动画效果
     -->
    <router-view/>
  </div>
</template>

<style lang="scss">
@import '@css/style.scss';
#app{
  width: 100%;
  height: 100%;
}
</style>
